In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
dataset = pd.read_csv('C:\\Users\\KXS26XY\\OneDrive - The Home Depot\\Desktop\\Data Science and Business Analytics\\Dateset_ODI.csv')
dataset.head()

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
0,ODI # 1,Australia,England,Australia,5 wickets,Melbourne,"Jan 5, 1971"
1,ODI # 2,England,Australia,England,6 wickets,Manchester,"Aug 24, 1972"
2,ODI # 3,England,Australia,Australia,5 wickets,Lord's,"Aug 26, 1972"
3,ODI # 4,England,Australia,England,2 wickets,Birmingham,"Aug 28, 1972"
4,ODI # 5,New Zealand,Pakistan,New Zealand,22 runs,Christchurch,"Feb 11, 1973"

In [3]:
dataset.shape

(3932, 7)

In [8]:
dataset.describe()

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
count,3932,3932,3932,3932,3753,3932,3932
unique,3932,24,25,25,227,173,3386
top,ODI # 517,Australia,Sri Lanka,Australia,6 wickets,Sharjah,"Feb 4, 2007"
freq,1,583,508,555,347,228,6

In [18]:
# On which ground are the maximum number of matches played?
dataset['Ground'].value_counts()
# Sharjah

Sharjah            228
Dhaka              156
Sydney             154
Melbourne          147
Harare             136
                  ...
Nairobi (Club)       1
Whangarei            1
Launceston           1
Vijayawada           1
Tunbridge Wells      1
Name: Ground, Length: 173, dtype: int64

In [21]:
# Which team won maximum matches on Ground ‘Sharjah’?
df_sharjah = dataset[dataset['Ground']=='Sharjah']
# df_sharjah.head()
df_sharjah['Winner'].value_counts()
# Pakistan

Pakistan        83
India           35
Sri Lanka       29
West Indies     19
Australia       14
South Africa    10
Afghanistan      9
New Zealand      9
England          8
Zimbabwe         8
tied             2
Netherlands      1
Canada           1
Name: Winner, dtype: int64

In [22]:
# On which date exactly 6 matches were played?
dataset['Match Date'].value_counts()
# Feb 4, 2007

Feb 4, 2007     6
Jun 20, 1983    4
Feb 2, 2007     4
Jun 7, 1975     4
Jun 18, 1983    4
               ..
Feb 28, 2007    1
Jun 13, 1979    1
Jan 20, 2009    1
Dec 6, 1980     1
Jul 18, 2001    1
Name: Match Date, Length: 3386, dtype: int64

In [23]:
# On which ground did Australia win the most number of matches?
df_aussie = dataset[dataset['Winner'] == 'Australia']
df_aussie['Ground'].value_counts()
# Sydney

Sydney         85
Melbourne      74
Adelaide       34
Perth          29
Brisbane       23
               ..
East London     1
Georgetown      1
Dublin          1
Chandigarh      1
Hambantota      1
Name: Ground, Length: 97, dtype: int64

In [28]:
# What is the number of times in which the winner was "Team 2"?
(dataset['Team 2'] == dataset['Winner']).sum()
# 1637

1637

In [29]:
# Which team won the most matches on Lord’s Ground?
df_lords = dataset[dataset['Ground'] == "Lord's"]
df_lords['Winner'].value_counts()
# England

England         23
Australia       12
West Indies      6
Sri Lanka        4
India            4
Pakistan         4
New Zealand      3
tied             2
no result        1
South Africa     1
Name: Winner, dtype: int64

In [30]:
x = 1

for i in range(1,10,2):

    print(x*i)

1
3
5
7
9

In [31]:
a = np.array([['m', '2'],['n','3']])
a[0,1]

'2'